Repository: art-den/electra_stacking
Catalog: po/*.po
Languages: ru

source: APP_DESCRIPTION
ru: Программа для сложения астрофотографий

source: cur_lang
ru: ru

source: Project/File name
ru: Проект/Файл

source: File path
ru: Путь

source: File time
ru: Время

source: Dimensions
ru: Разрешение

source: Camera
ru: Камера

source: Exposure
ru: Выдержка

source: FNumber
ru: Диафрагма

source: Noise
ru: Шум

source: Background
ru: Фон

source: Stars
ru: Кол. звёзд

source: Ovality
ru: Овальность

source: Sharpness
ru: Резкость

source: Focal len
ru: Фок.расст.

source: Unnamed project
ru: Безымянный проект

source: Main group
ru: Главная группа

source: Group
ru: Группа

source: Light files
ru: Файлы изображения (light)

source: Dark files
ru: Темновые файлы (dark)

source: Flat files
ru: Файлы плоского поля (flat)

source: Bias files
ru: Файлы смещения (bias)

source: _Save
ru: _Сохранить

source: _Open
ru: Открыть

source: _Cancel
ru: Отменить

source: _Close
ru: Закрыть

source: _Yes
ru: Да

source: _No
ru: Нет

source: _Add
ru: Добавить

source: _Assign
ru: Установить

source: Project
ru: Проект

source: New project
ru: Новый проект

source: Open project...
ru: Открыть проект...

source: Open recent
ru: Предыдущие проекты

source: Save project
ru: Сохранить проект

source: Save project as...
ru: Сохранить проект как...

source: Exit
ru: Выход

source: Processing
ru: Обработка

source: Add light files...
ru: Добавить файлы изображения (light)...

source: Add dark files...
ru: Добавить темновые файлы (dark)...

source: Add flat files...
ru: Добавить файлы поля (flat)...

source: Add bias files...
ru: Добавить файлы смещения (bias)...

source: Add new group...
ru: Новая группа

source: Register light files
ru: Зарегистрировать файлы изображения

source: Cleanup light files...
ru: Отключить неудачные файлы изображения

source: Assign reference light image...
ru: Установить опорный кадр...

source: Stack light files
ru: Сложить файлы изображения

source: Configuration
ru: Настройки

source: Project configuration...
ru: Настройки проекта...

source: Theme
ru: Тема оформления

source: Dark theme
ru: Тёмная

source: Light theme
ru: Светлая

source: CPU load
ru: Нагрузка на ЦПУ

source: Minimal
ru: Минимальная

source: Half
ru: Средняя

source: Maximal
ru: Максимальная

source: Help
ru: Помощь

source: About...
ru: О программе...

source: Use as reference image
ru: Использовать как опорный кадр

source: Change file(s) type
ru: Сменить тип файлов

source: Into light file(s)
ru: На файлы изображения (light)

source: Into dark file(s)
ru: На темновые файлы (dark)

source: Into flat file(s)
ru: На кадры поля (light)

source: Into bias file(s)
ru: На кадры смещения (bias)

source: Move file(s) to group...
ru: Переместить файлы в группу

source: Check all file(s)
ru: Отметить все файлы

source: Uncheck all file(s)
ru: Снять отметку со всех файлов

source: Check selected file(s)
ru: Отметить выбранные файлы

source: Uncheck selected file(s)
ru: Убрать отметку с выбранных файлов

source: Remove item(s)...
ru: Убрать из проекта...

source: Item properties...
ru: Свойства...

source: Project columns...
ru: Колонки проекта...

source: Scale:
ru: Размер:

source: Fit in window
ru: По размеру окна

source: Gamma:
ru: Гамма:

source: Auto minimum
ru: Авто минимум

source: Auto WB
ru: Авто ББ

source: Cancel
ru: Отмена

source: Error
ru: Ошибка

source: Finished
ru: Завершено

source: Reference image is not defined
ru: Не задан опорный кадр

source: You have execute register light files first!
ru: Вы должны выполнить регистрацию файлов изображения вначале!

source: Loading reference image...
ru: Загружается опорное изображение...

source: Can't find group with reference image
ru: Не могу найти группу с опорным кадром

source: Cancelled
ru: Отменено

source: No light files to stack
ru: Нету файлов изображения для сложения

source: Stacking all images into result image file...
ru: Складываю все изображения в конечный файл...

source: You have to save project before
ru: Вы должны сохранить проект вначале

source: Loading calibration master files...
ru: Загрузка калибровочных файлов...

source: Conditions are too strict
ru: Условия слишком жёсткие

source: Close application
ru: Закрытие программы

source: Project changes. Save?
ru: Проект был изменён. Сохранить?

source: Select project file to open
ru: Выберите файл проекта чтобы открыть

source: Select project file to save
ru: Выберите файл проекта для сохранения

source: Confirmation
ru: Подтверждение

source: Change file types
ru: Изменение типа файлов

source: No files to register
ru: Отсутствуют light-файлы для регистрации

source: Change type of {count} file(s) from {from_type} into {into_type}?
ru: Изменить тип {count} файлов из {from_type} на {into_type}?

source: Result file saved to {fn}
ru: Полученный результат записан в {fn}

source: Remove file '{fn}' from project?
ru: Убрать файл '{fn}' из проекта?

source: Remove {cnt} files from project?
ru: Убрать файлы в количестве {cnt} из проекта?

source: Remove group '{group}' from project?
ru: Удалить группу '{group}' из проекта?

source: Project options
ru: Настройки проекта

source: Common
ru: Основные настройки

source: Stacking
ru: Сложение

source: For each light file
ru: Для каждого файла изображения (light)

source: Color camera
ru: Для цветных камер

source: Project name:
ru: Имя проекта:

source: Image size:
ru: Размер изображения:

source: Original
ru: Оригинальный

source: Result image type:
ru: Тип конечного изображения:

source: Align RGB channels in result image
ru: Выравнивать RGB-каналы в результирующем изображении

source: Align RGB channels in each light image (slow)
ru: Выравнивать RGB-каналы в каждом light-изображении (медленно)

source: Repeats
ru: Повторов

source: Lights stacking mode:
ru: Режим сложения изображений (light):

source: Darks stacking mode:
ru: Режим сложения темновых кадров (dark):

source: Flats stacking mode:
ru: Режим сложения кадров поля (flat):

source: Bias stacking mode:
ru: Режим сложения кадров смещения (bias):

source: Median
ru: Медианное среднее

source: Mean
ru: Среднее

source: Save calibrated and aligned image
ru: Сохранить калиброванное и выровненное изображение

source: Save common star image
ru: Сохранить изображение обобщённой звезды

source: Apply camera white balance
ru: Применять баланс белого

source: Apply camera color profile
ru: Применять цветовой профиль

source: Cleanup bad light files
ru: Очистка от неудачных файлов изображения (light)

source: Enable all light files before execute
ru: Отметить все файлы перед очисткой

source: Cleanup mode
ru: Режим очистки

source: Percent
ru: Процент

source: By stars FWHM
ru: По площади звёзд (FWHM)

source: By stars ovality
ru: По овальности звёзд

source: By stars count
ru: По количеству звёзд

source: By image sharpness
ru: По резкости изображения

source: By noise
ru: По шуму изображения

source: By background
ru: По фону изображения

source: _Cleanup
ru: Очистка

source: Cleanup light files result
ru: Результат очистки

source: Cleaned up {cleaned} files of {total} ({percent}%)
ru: Отключено {cleaned} файлов из {total} ({percent}%)

source: Select group:
ru: Выберите группу:

source: Select LIGHT files
ru: Выберите файлы изображения (light)

source: Select DARK files
ru: Выберите темновые файлы (dark)

source: Select FLAT files
ru: Выберите файлы поля (flat)

source: Select BIAS files
ru: Выберите файлы смещения (bias)

source: Add light files
ru: Добавление файлов изображения (light)

source: Add dark files
ru: Добавление темновых файлов (dark)

source: Add flat files
ru: Добавление файлов поля (flat)

source: Add bias files
ru: Добавление файлов смещения (bias)

source: Add new group
ru: Добавление новой группы

source: Group properties
ru: Свойства группы

source: Group name
ru: Имя группы

source: Default
ru: По умолчанию

source: Custom:
ru: Задать:

source: Move files to another group
ru: Перемещение файлов в другую группу

source: Select group to move selected file(s):
ru: Выберите группу в которую надо переместить файлы:

source: Existing group:
ru: Существующая группа

source: New group:
ru: Новая группа:

source: Leave empty for default
ru: Пустое - по умолчанию

source: About
ru: О программе

source: Web site
ru: Перейти на сайт

source: Discussion
ru: Обсуждение программы

source: Project columns
ru: Колонки проекта

source: Add files into project
ru: Добавление файлов в проект

source: Add {files} file(s) into project?
ru: Добавить {files} файл(ов) в проект?

source: Group:
ru: Группа:

source: File type:
ru: Тип файлов:

source: Assigning reference image
ru: Установка опорного кадра

source: Assign one of image as reference one by:
ru: Назначить опорный кадр по:

source: Smallest stars
ru: Минимальному размеру звёзд

source: Roundest stars
ru: Самым ровным звёздам

source: Minimum background brightness
ru: Минимальной яркости фона

source: Minimum noise
ru: Минимальному шуму изображения

source: Press "Cancel" if you want to assign reference image manually
ru: Нажмите "Отменить" если вы хотите установить опорный кадр вручную
